Tutorials-3.0.0/compressible/convDivNozzle/LTS/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoCentralFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         800;

deltaT          1;

writeControl    timeStep;

writeInterval   400;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep true;

maxCo           0.5;

maxDeltaT       1e-3;

rDeltaTSmoothingCoeff 0.02;

rDeltaTDampingCoeff	0.5;

CourantType	cellCourant;

#include "functionObjects"

// ************************************************************************* //
